docs/posts/2016-06-23-emacs-on-the-ipad.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 29, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs on the iPad</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Emacs on the iPad</h1>
<p class="subtitle" role="doc-subtitle">Jun 23, 2016</p>
</header><p>
The iPad Pro has more people considering using the iPad for production, not just for entertainment. I have long been jealous of those who could use an iPad for most of their work, especially now, as iPad displays get bigger and nicer. I would love to be able to throw an iPad and keyboard into a small bag and be able to use the same tool for both reading and writing.
</p>

<p>
Unfortunately, though, two things have kept me from being able to easily do that. First, I do almost of all my work in Emacs, and I&rsquo;m afraid that Apple would never allow Emacs on the iPad. Second, except for blog posts, almost everything I write eventually becomes a LaTeX document that is compiled into a PDF.
</p>

<p>
I&rsquo;m sure that most people wouldn&rsquo;t be troubled at all by either of these problems. My projects usually begin as Markdown files, and there are some decent Markdown editors on iOS. Most of these are limited to using one subfolder in Dropbox, and I have a folder for each course, writing project, my website, etc. A larger problem is that Emacs becomes a finely tuned, personal tool for a user. With one keystroke, I can renumber ordered lists, insert a reference from my bibliography database, commit changes to a git repository, and many other things. Once this has become ingrained, it is very difficult to go to anything else. I can write LaTeX on the iPad, but I can&rsquo;t compile. That still has to be done on another machine. So, while others are carrying their nice, light tablets, I&rsquo;ve been schlepping a MacBook Pro.
</p>

<p>
A few days ago, I noticed that <a href="http://www.digitalocean.com">Digital Ocean</a> has a remote server plan with 20 GB of solid state storage for five dollars a month. It only has 512 MB of memory, but that seems to be plenty for Emacs and Vim. I signed up, started a machine, and installed Ubuntu. I installed Emacs, Vim, Pandoc, and LaTeX. I changed the shell to the fish shell, and moved all of my configuration files. Since the configuration files are all on Github, moving them to the machine was simple.
</p>

<p>
So, the good news is that I&rsquo;m now writing this in Emacs on the iPad. The bad news is, since I had given up being able to use the iPad to write, I traded in my larger iPad for an iPad mini. Now, I really will be looking longingly at those iPad Pros I see at Starbucks.
</p>


<div class="tagline" id="org2dbb7e4">
<p>
Tagged: <a href="../tags/emacs.html">Emacs</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 29, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
